andoma/mios/src/platform/nrf54l/nrf54l_radio.c
// BLE peripheral link-layer for the nRF54L radio. Ported from the nRF52 one
// (src/platform/nrf52/nrf52_radio.c): the link-layer / l2cap / netif logic is
// kept verbatim; what changed is the hardware layer:
//   - the modern nRF54L RADIO register map (events 0x200+, config 0xE00+),
//   - TIMER10 (radio-power-domain timer) instead of TIMER0,
//   - DPPIC10 (publish/subscribe) instead of the nRF52 fixed PPI channels,
//   - HFXO kept running while the stack is up (no per-event xtal management),
//   - INTENSET00 / RADIO_0 + TIMER10 NVIC lines, FICR device address.

#include "nrf54l_reg.h"
#include "nrf54l_radio.h"

#include "net/pbuf.h"
#include "net/ble/l2cap.h"
#include "net/ble/ble_proto.h"

#include <sys/param.h>

#include <mios/timer.h>
#include <mios/task.h>
#include <mios/ghook.h>

#include <stdlib.h>
#include <string.h>
#include <unistd.h>
#include <assert.h>
#include <stdio.h>

#include "irq.h"
#include "nrf54l_radio_core.h" // RADIO register map + HFXO + PHY presets
#include "nrf54l_radio_arb.h"  // time-division arbiter (BLE vs 802.15.4)
#include "nrf54l_154.h"        // 15.4 stats for the shared 'radio' device info

// --- TIMER10 (same register layout as the nRF52 TIMER) ---------------------
#define TIMER_BASE 0x50085000
#define TIMER_IRQ  133

#define TIMER_TASKS_START        0x000
#define TIMER_TASKS_STOP         0x004
#define TIMER_TASKS_CLEAR        0x00c
#define TIMER_SUBSCRIBE_CAPTURE(x) (0x0c0 + (x) * 4)
#define TIMER_EVENTS_COMPARE(x)  (0x140 + (x) * 4)
#define TIMER_PUBLISH_COMPARE(x) (0x1c0 + (x) * 4)
#define TIMER_INTENSET           0x304
#define TIMER_BITMODE            0x508
#define TIMER_PRESCALER          0x510
#define TIMER_CC(x)             (0x540 + (x) * 4)

// TIMER10 PCLK is 32 MHz; /32 -> 1 MHz, so the link-layer keeps working in µs.
#define TIMER_PRESCALER_1MHZ     5

// --- DPPIC10 (shared by RADIO and TIMER10, same power domain) ---------------
#define DPPIC_BASE 0x50082000
#define DPPIC_CHENSET (DPPIC_BASE + 0x504)
#define DPPIC_CHENCLR (DPPIC_BASE + 0x508)

#define DPPI_EN 0x80000000u // PUBLISH/SUBSCRIBE enable bit

// DPPI channel assignment (mirrors the nRF52 fixed PPI channels it replaces):
#define DPPI_CH_ADDRESS  0 // RADIO ADDRESS  -> TIMER CAPTURE[1]  (was PPI 26)
#define DPPI_CH_END      1 // RADIO END      -> TIMER CAPTURE[2]  (was PPI 27)
#define DPPI_CH_TXEN     2 // TIMER COMPARE0 -> RADIO TXEN        (was PPI 20)

// FICR factory device address.
#define FICR_DEVICEADDR0 0x00ffc3a4
#define FICR_DEVICEADDR1 0x00ffc3a8


// Link Layer State
typedef enum {
  LL_IDLE,
  LL_ADV_TX,
  LL_ADV_RX,
  LL_CONNECTED_IDLE,
  LL_CONNECTED_RX_1,
  LL_CONNECTED_RX_N,
  LL_CONNECTED_TX,
} ll_state_t;

const char state2str[8][8] = {
  "Idle",
  "Adv_TX",
  "Adv_RX",
  "ConnIdl",
  "ConnRx1",
  "ConnRxN",
  "ConnTx"
};


typedef struct connection {

  l2cap_t l2c;

  uint32_t access_addr;
  uint32_t crc_iv;

  // Time related variables are stored as µS

  uint32_t transmitWindowDelay;  // Depends on connect PDU
  uint32_t transmitWindowSize;   // from lldata
  uint32_t transmitWindowOffset; // from lldata
  uint32_t connInterval;
  uint32_t latency;
  uint32_t timeout;

  uint32_t next_anchor_point;
  uint32_t window_open_offset;
  uint32_t next_timeout;

  uint8_t hop_increment;
  uint8_t last_unmapped_channel;
  uint8_t chmap[37];

  uint8_t last_rx_seq;
  uint8_t tx_seq;
  uint8_t tx_dummy;
  uint8_t termination_code;

  uint8_t pending_chmask_valid;
  uint8_t pending_chmask[5];
  uint16_t pending_chmask_instant;

  // PHY update procedure (same pending/instant pattern as the channel map).
  // rx_phy/tx_phy hold LL_PHY_* bits; asymmetric configurations are allowed.
  uint8_t rx_phy; // central -> us
  uint8_t tx_phy; // us -> central
  uint8_t pending_phy_valid;
  uint8_t pending_rx_phy;
  uint8_t pending_tx_phy;
  uint16_t pending_phy_instant;

  uint16_t eventCounter;

  struct {
    uint32_t rx;
    uint32_t tx;
    uint32_t rx_qdrops;
    uint32_t rx_bad_seq;
    uint32_t rx_silent;
    uint32_t rx_crc;
    uint32_t tx_retransmissions;
    int rx_maxlen;
  } stat;

  uint8_t addr[6];

  uint8_t rssi;

} connection_t;


typedef struct nrf54l_radio {

  netif_t nr_bn;

  ll_state_t nr_ll_state;

  pbuf_t *nr_pbuf;

  timer_t nr_slow_timer;
  uint32_t nr_softirq_enter_adv;

  connection_t nr_con;

  uint32_t nr_announce_interval;

  uint8_t nr_adv_chans_left; // channels remaining in the current adv event

  uint8_t nr_addr[6];

  uint8_t nr_adv_pkt[2 + 6 + 31];

  uint8_t nr_empty_packet[2];

  uint8_t nr_more_data;

  uint8_t nr_adv_ch;
} nrf54l_radio_t;


static nrf54l_radio_t g_radio;

static void
build_adv_pkt(nrf54l_radio_t *nr, const char *name)
{
  const size_t namelen = strlen(name);

  uint8_t *p = nr->nr_adv_pkt;
  p[0] = ADV_IND | ADV_TXADD; // Random address
  p[1] = 6 + 3 + namelen + 2;
  memcpy(p + 2, nr->nr_addr, 6);
  // Flags AD is mandatory for hosts to treat us as discoverable: BlueZ hides
  // devices that advertise without it (iOS scanners do not care).
  p[8] = 2;
  p[9] = 1;    // Flags
  p[10] = 6;   // LE General Discoverable, BR/EDR not supported
  p[11] = namelen + 1;
  p[12] = 9;   // Complete Local Name
  memcpy(p + 13, name, namelen);
}


static const uint8_t channel_to_freq[40] = { // 2400 MHz + indexed value
     4,  6,  8, 10, 12, 14, 16, 18, 20, 22,  //  0 -  9
    24, 28, 30, 32, 34, 36, 38, 40, 42, 44,  // 10 - 19
    46, 48, 50, 52, 54, 56, 58, 60, 62, 64,  // 20 - 29
    66, 68, 70, 72, 74, 76, 78,              // 30 - 36
    2, 26, 80                                // 37 - 39  (ADV channels)
};


static void
select_channel(int channel, uint32_t crc_init, uint32_t access_addr)
{
  reg_wr(RADIO_FREQUENCY, channel_to_freq[channel]);
  // Whitening: keep the BLE polynomial (DATAWHITE.POLY reset = 0x89) and load
  // the per-channel IV = channel with bit 6 preset (the nRF54L radio does not
  // auto-force that bit, unlike the nRF52 one).
  reg_wr(RADIO_DATAWHITE, (0x89 << 16) | (0x40 | channel));
  reg_wr(RADIO_CRCINIT, crc_init);
  reg_wr(RADIO_BASE0, access_addr << 8);
  reg_wr(RADIO_PREFIX0, access_addr >> 24);
}


static void
radio_init_ble(void)
{
  // The BLE PHY preset now lives in radio-core so the radio can be re-asserted
  // for BLE after another protocol (15.4) has borrowed it.
  nrf54l_radio_use_ble();
}


// Program the radio for a BLE PHY: symbol rate and the matching preamble
// length (2M uses a 16-bit preamble).
static void
radio_set_phy(uint8_t ll_phy)
{
  const int is2m = ll_phy & LL_PHY_2M;
  reg_wr(RADIO_MODE, is2m ? 4 : 3);
  reg_wr(RADIO_PCNF0,
         (8 << 0) |             // LFLEN
         (1 << 8) |             // S0LEN
         ((is2m ? 1 : 0) << 24)); // PLEN: 8-bit (1M) / 16-bit (2M)
}


static void
radio_setup_for_adv(nrf54l_radio_t *nr)
{
  nr->nr_adv_ch++;
  if(nr->nr_adv_ch == 3)
    nr->nr_adv_ch = 0;

  radio_set_phy(LL_PHY_1M); // legacy advertising is always 1M
  select_channel(37 + nr->nr_adv_ch, 0x555555, 0x8e89bed6);
}

static void
conn_update_channels(uint8_t *chmap, const uint8_t *mask)
{
  int num_used = 0;
  for(int i = 0; i <= 36; i++) {
    int used = mask[i / 8] & (1 << (i & 7));
    if(used) {
      chmap[num_used] = i;
      num_used++;
    }
  }

  for(int i = 36; i >= 0; i--) {
    int used = mask[i / 8] & (1 << (i & 7));
    if(used) {
      chmap[i] = i;
    } else {
      chmap[i] = chmap[i % num_used];
    }
  }
}


static void
conn_fini(connection_t *con)
{
  pbuf_free_queue_irq_blocked(&con->l2c.l2c_tx_queue);
  con->l2c.l2c_tx_queue_len = 0;
}


static void
conn_output(struct l2cap *self, struct pbuf *pb)
{
  connection_t *con = (connection_t *)self;

