andoma/mios/src/platform/nrf54l/nrf54l_radio.c
  if(pb == NULL) {
    // l2cap layer closed
    con->l2c.l2c_output = NULL;
    return;
  }

  int payload_len = pb->pb_pktlen;
  pb = pbuf_prepend(pb, 2, 1, 0);
  if(pbuf_pullup(pb, pb->pb_pktlen)) {
    panic("pullup failed");
  }

  uint8_t *hdr = pbuf_data(pb, 0);
  hdr[0] = pb->pb_flags & PBUF_SOP ? 2 : 1;
  hdr[1] = payload_len;

  int q = irq_forbid(IRQ_LEVEL_NET);
  STAILQ_INSERT_TAIL(&con->l2c.l2c_tx_queue, pb, pb_link);
  con->l2c.l2c_tx_queue_len++;
  irq_permit(q);
}

static void
conn_init(connection_t *con, const struct lldata *lld)
{
  con->l2c.l2c_output = conn_output;

  STAILQ_INIT(&con->l2c.l2c_tx_queue);

  conn_update_channels(con->chmap, lld->channel_mask);
  con->hop_increment = lld->hop_sca & 0x1f;
  con->last_unmapped_channel = 0;

  con->crc_iv =
    lld->crcinit[0] | (lld->crcinit[1] << 8) | (lld->crcinit[2] << 16);

  con->access_addr = lld->access_addr;

  con->transmitWindowDelay = 1250;
  con->transmitWindowSize = lld->win_size * 1250;
  con->transmitWindowOffset = lld->win_offset * 1250;
  con->connInterval = lld->interval * 1250;
  con->timeout = lld->timeout * 10000;

  // We say previously receved SN was 1 (thus, we expect 0)
  con->last_rx_seq = DATA_SN;
  con->tx_seq = 0;
  con->tx_dummy = 1;
  con->termination_code = 0;

  con->pending_chmask_valid = 0;

  con->rx_phy = LL_PHY_1M;
  con->tx_phy = LL_PHY_1M;
  con->pending_phy_valid = 0;

  con->eventCounter = 0xffff;
}


static void
conn_disconnect(nrf54l_radio_t *nr, uint32_t now)
{
  softirq_raise(nr->nr_softirq_enter_adv);
  ghook_invoke(GHOOK_BLE_STATUS, 0);

  nr->nr_ll_state = LL_IDLE;
  reg_wr(TIMER_BASE + TIMER_TASKS_STOP, 1);
  nrf54l_radio_arb_release(); // connection gone: lend radio to 802.15.4
}


static void
conn_hop(nrf54l_radio_t *nr, connection_t *con)
{
  // 4.5.8.2 Channel Selection algorithm #1
  uint8_t ch = (con->last_unmapped_channel + con->hop_increment) % 37;
  con->last_unmapped_channel = ch;
  select_channel(con->chmap[ch], con->crc_iv, con->access_addr);
}


static void
arm_timer3(uint32_t when)
{
  reg_wr(TIMER_BASE + TIMER_CC(3), when);
}


static int
handle_CONNECT_IND(nrf54l_radio_t *nr, const uint8_t *pkt)
{
  const struct lldata *lld = (struct lldata *)(pkt + 14);
  connection_t *con = &nr->nr_con;

  if(l2cap_connect(&con->l2c))
    return 0;

  memcpy(con->addr, pkt + 2, 6);

  conn_init(con, lld);

  uint32_t rx_end_time = reg_rd(TIMER_BASE + TIMER_CC(2));

  con->next_anchor_point =
    rx_end_time + con->transmitWindowDelay +
    con->transmitWindowOffset;

  con->window_open_offset = 1000;

  arm_timer3(con->next_anchor_point - con->window_open_offset);

  nr->nr_ll_state = LL_CONNECTED_IDLE;

  con->next_timeout = con->next_anchor_point  + con->timeout;
  netlog("ble: Connected to %02x:%02x:%02x:%02x:%02x:%02x RSSI:%d hop:%d (on %d)",
         pkt[2 + 5], pkt[2 + 4], pkt[2 + 3],
         pkt[2 + 2], pkt[2 + 1], pkt[2 + 0],
         -reg_rd(RADIO_RSSISAMPLE),
         con->hop_increment,
         37 + nr->nr_adv_ch);

  memset(&con->stat, 0, sizeof(con->stat));

  ghook_invoke(GHOOK_BLE_STATUS, 1);
  return 1;
}


static int
adv_rx(nrf54l_radio_t *nr)
{
  const uint8_t *pkt = pbuf_cdata(nr->nr_pbuf, 0);
  const uint8_t pdu_type = pkt[0] & 0xf;

  // We just listen for CONNECT
  if(pdu_type != CONNECT_IND)
    return 0;

  if(!(pkt[0] & ADV_RXADD))
    return 0;

  if(memcmp(pkt + 8, nr->nr_addr, 6))
    return 0; // Not for us

  return handle_CONNECT_IND(nr, pkt);
}


static uint8_t *
enqueue_ctrl_pdu(connection_t *con, uint8_t type, uint8_t len)
{
  pbuf_t *pb = pbuf_make_irq_blocked(0, 0);
  if(pb == NULL)
    return NULL; // No buffer -> no ack -> peer will retransmit later

  STAILQ_INSERT_TAIL(&con->l2c.l2c_tx_queue, pb, pb_link);
  con->l2c.l2c_tx_queue_len++;

  uint8_t *rsp = pbuf_data(pb, 0);
  rsp[0] = 3;
  rsp[1] = len + 1;
  rsp[2] = type;
  return rsp + 3;
}


static int
handle_ll_feature_req(connection_t *con, const uint8_t *req, int reqlen)
{
  uint8_t *rsp = enqueue_ctrl_pdu(con, LL_FEATURE_RSP, 8);
  if(rsp == NULL)
    return 0;
  memset(rsp, 0, 8);

  if(req[0] & (1 << 5)) {
    rsp[0] |= 1 << 5;
  }
  rsp[1] |= 0x01; // LE 2M PHY (FeatureSet bit 8)
  return 1;
}


static int
handle_ll_phy_req(connection_t *con, const uint8_t *req, int reqlen)
{
  uint8_t *rsp = enqueue_ctrl_pdu(con, LL_PHY_RSP, 2);
  if(rsp == NULL)
    return 0;
  rsp[0] = LL_PHY_1M | LL_PHY_2M; // our TX capabilities
  rsp[1] = LL_PHY_1M | LL_PHY_2M; // our RX capabilities
  return 1;
}


static int
handle_ll_phy_update_ind(connection_t *con, const uint8_t *req, int reqlen)
{
  if(reqlen < 4)
    return 1;

  const uint8_t phy_m_to_s = req[0]; // our RX; 0 = unchanged
  const uint8_t phy_s_to_m = req[1]; // our TX; 0 = unchanged

  if(phy_m_to_s == 0 && phy_s_to_m == 0)
    return 1; // no change, instant is ignored

  con->pending_rx_phy = phy_m_to_s;
  con->pending_tx_phy = phy_s_to_m;
  con->pending_phy_instant = req[2] | (req[3] << 8);
  con->pending_phy_valid = 1;
  return 1;
}


static int
handle_unknown_ctrlop(connection_t *con, uint8_t op)
{
  uint8_t *rsp = enqueue_ctrl_pdu(con, LL_UNKNOWN_RSP, 1);
  if(rsp == NULL)
    return 0;
  rsp[0] = op;
  return 1;
}


static int
handle_ll_channel_map_ind(connection_t *con, const uint8_t *req, int reqlen)
{
  if(reqlen < 7)
    return 1;

  memcpy(&con->pending_chmask, req, 5);
  memcpy(&con->pending_chmask_instant, req + 5, 2);
  con->pending_chmask_valid = 1;
  return 1;
}


static int
handle_ll_version_ind(connection_t *con, const uint8_t *req, int reqlen)
{
  uint8_t *rsp = enqueue_ctrl_pdu(con, LL_VERSION_IND, 5);
  if(rsp == NULL)
    return 0;

  rsp[0] = 0x0c; // Core_v5.3
  rsp[1] = 0x59; // Nordic semiconductor
  rsp[2] = 0x00;
  rsp[3] = 0x00;
  rsp[4] = 0x00;
  return 1;
}

static int
handle_ll_length_req(connection_t *con, const uint8_t *req, int reqlen)
{
  uint8_t *rsp = enqueue_ctrl_pdu(con, LL_LENGTH_RSP, 8);
  if(rsp == NULL)
    return 0;

  int o = LLMTU;
  int t = 2120;
  rsp[0] = o;
  rsp[1] = o >> 8;
  rsp[2] = t;
  rsp[3] = t >> 8;
  rsp[4] = o;
  rsp[5] = o >> 8;
  rsp[6] = t;
  rsp[7] = t >> 8;
  return 1;
}


static int
conn_terminate(nrf54l_radio_t *nr, connection_t *con, uint8_t code,
               const char *origin)
{
  if(con->termination_code)
    return 1;

