andoma/mios/src/platform/nrf54l/nrf54l_radio.c
  netlog("ble: Terminated (code=0x%x) (%s)", code, origin);

  l2cap_disconnect(&con->l2c);

  con->termination_code = code;
  return 1;
}


static int
handle_ctrl_pdu(nrf54l_radio_t *nr, connection_t *con,
                const uint8_t *req, int reqlen)
{
  if(reqlen == 0)
    return 1; // Invalid according to spec, but we ack anyway

  switch(req[0]) {
  case LL_FEATURE_REQ:
    return handle_ll_feature_req(con, req + 1, reqlen - 1);
  case LL_CHANNEL_MAP_IND:
    return handle_ll_channel_map_ind(con, req + 1, reqlen - 1);
  case LL_VERSION_IND:
    return handle_ll_version_ind(con, req + 1, reqlen - 1);
  case LL_TERMINATE_IND:
    return conn_terminate(nr, con, req[1], "remote");
  case LL_LENGTH_REQ:
    return handle_ll_length_req(con, req + 1, reqlen - 1);
  case LL_PHY_REQ:
    return handle_ll_phy_req(con, req + 1, reqlen - 1);
  case LL_PHY_UPDATE_IND:
    return handle_ll_phy_update_ind(con, req + 1, reqlen - 1);
  default:
    return handle_unknown_ctrlop(con, req[0]);
  }
}


static void
conn_rx_done(nrf54l_radio_t *nr)
{
  connection_t *con = &nr->nr_con;
  int n = 0;

  nr->nr_more_data = 0;

  con->rssi = reg_rd(RADIO_RSSISAMPLE);

  if(reg_rd(RADIO_CRCSTATUS)) {

    if(nr->nr_ll_state == LL_CONNECTED_RX_1) {
      const uint32_t capt = reg_rd(TIMER_BASE + TIMER_CC(1));
      n = capt - (con->next_anchor_point - con->connInterval);
      con->next_anchor_point = capt + con->connInterval;
      arm_timer3(con->next_anchor_point - con->window_open_offset);
    }

    uint8_t *pkt = pbuf_data(nr->nr_pbuf, 0);

    const uint8_t b0 = pkt[0];
    const uint8_t len = pkt[1];
    con->stat.rx_maxlen = MAX(con->stat.rx_maxlen, len);

    if(b0 & DATA_SN)
      con->window_open_offset = 250;

    if(con->tx_seq == !(b0 & DATA_NESN)) {
      // Remote received our packet
      if(!con->tx_dummy) {
        pbuf_t *pb = pbuf_splice(&con->l2c.l2c_tx_queue);
        assert(pb != NULL);
        assert(pb->pb_next == NULL);
        assert(con->l2c.l2c_tx_queue_len > 0);
        pbuf_free_irq_blocked(pb);
        con->l2c.l2c_tx_queue_len--;
      }

      con->tx_seq = !con->tx_seq;
      con->stat.tx++;
    } else {
      con->stat.tx_retransmissions++;
    }

    if(b0 & DATA_MD)
      nr->nr_more_data |= 1;

    if((con->last_rx_seq ^ b0) & DATA_SN) {

      const uint8_t llid = b0 & 3;
      int ack;
      pbuf_t *pb;

      switch(llid) {
      case 0:  // Reserved future use
        ack = 1;
        break;
      case 1:
      case 2:
        if(!len || con->termination_code) {
          ack = 1;
        } else {
          pb = pbuf_make_irq_blocked(0, 0);
          if(pb == NULL) {
            ack = 0;
            break;
          }

          pbuf_t *rx = nr->nr_pbuf;
          rx->pb_pktlen = 0;
          rx->pb_buflen = len;
          rx->pb_offset = 2;
          rx->pb_flags = llid == 2 ? PBUF_SOP : 0;
          ack = 1;
          l2cap_input(&con->l2c, rx);
          nr->nr_pbuf = pb;
        }
        break;

      case 3:
        ack = handle_ctrl_pdu(nr, con, pkt + 2, len);
        break;
      }

      if(ack) {
        con->last_rx_seq = b0 & DATA_SN;
        con->stat.rx++;
      } else {
        con->stat.rx_qdrops++;
      }
    } else {
      con->stat.rx_bad_seq++;
    }
  } else {
    con->stat.rx_crc++;
  }

  // Prepare for transmit
  pbuf_t *pb = STAILQ_FIRST(&con->l2c.l2c_tx_queue);
  uint8_t *pkt;
  if(pb == NULL) {
    pkt = nr->nr_empty_packet;
    con->tx_dummy = 1;
  } else {
    pkt = pbuf_data(pb, 0);
    con->tx_dummy = 0;
    if(pb->pb_next)
      nr->nr_more_data |= 2;
  }

  uint8_t b0 = pkt[0];
  b0 &= ~(DATA_NESN | DATA_SN | DATA_MD);

  if(!con->last_rx_seq)
    b0 |= DATA_NESN;

  if(nr->nr_more_data & 2)
    b0 |= DATA_MD;

  b0 |= con->tx_seq & 1 ? DATA_SN : 0;
  pkt[0] = b0;

  // The radio is disabled between RX and the timed TXEN (PHYEND_DISABLE
  // short), so the transmit direction's PHY can be programmed here.
  radio_set_phy(con->tx_phy);
  reg_wr(RADIO_PACKETPTR, (intptr_t)pkt);

  uint32_t rxend = reg_rd(TIMER_BASE + TIMER_CC(2));
  uint32_t txstart = rxend + 110; // + 40µS ramp-up = 150µS T_IFS

  reg_wr(TIMER_BASE + TIMER_CC(0), txstart);
  reg_wr(DPPIC_CHENSET, (1 << DPPI_CH_TXEN)); // TIMER COMPARE0 -> RADIO TXEN

  con->next_timeout = con->next_anchor_point + con->timeout;

  if(n < -50 || n > 50)
    netlog("ble: Anchor adjust:%d @ %d", n, nr->nr_ll_state);

  nr->nr_ll_state = LL_CONNECTED_TX;
}


static void
conn_tx_done(nrf54l_radio_t *nr)
{
  reg_wr(DPPIC_CHENCLR, (1 << DPPI_CH_TXEN));

  if(nr->nr_more_data) {
    nr->nr_ll_state = LL_CONNECTED_RX_N;
    radio_set_phy(nr->nr_con.rx_phy);
    reg_wr(RADIO_PACKETPTR, (intptr_t)pbuf_data(nr->nr_pbuf, 0));
    reg_wr(RADIO_TASKS_RXEN, 1);
  } else {
    nr->nr_ll_state = LL_CONNECTED_IDLE;
    nrf54l_radio_arb_release(); // idle until next anchor: lend radio to 802.15.4
  }
}


static void
conn_open_window(nrf54l_radio_t *nr)
{
  connection_t *con = &nr->nr_con;
  int delta = con->next_anchor_point - con->next_timeout;
  if(delta > 0) {
    netlog("ble: timo %d %d %d", delta, con->next_anchor_point,
           con->next_timeout);
    conn_terminate(nr, con, 0x08, "local");
  }

  if(con->termination_code && con->l2c.l2c_output == NULL) {
    conn_disconnect(nr, con->next_anchor_point);
    conn_fini(con);
    netlog("ble: Disconnected (code=0x%x)", con->termination_code);
    return;
  }

  con->eventCounter++;

  if(con->pending_chmask_valid &&
     con->pending_chmask_instant == con->eventCounter) {
    conn_update_channels(con->chmap, con->pending_chmask);
    con->pending_chmask_valid = 0;
  }

  if(con->pending_phy_valid &&
     con->pending_phy_instant == con->eventCounter) {
    if(con->pending_rx_phy)
      con->rx_phy = con->pending_rx_phy;
    if(con->pending_tx_phy)
      con->tx_phy = con->pending_tx_phy;
    con->pending_phy_valid = 0;
    netlog("ble: PHY update rx:%s tx:%s",
           con->rx_phy & LL_PHY_2M ? "2M" : "1M",
           con->tx_phy & LL_PHY_2M ? "2M" : "1M");
  }

  nrf54l_radio_arb_acquire(); // take the radio from 802.15.4 for this event
  conn_hop(nr, con);

