andoma/mios/src/platform/nrf54l/nrf54l_radio.c
  nr->nr_ll_state = LL_CONNECTED_RX_1;
  radio_set_phy(con->rx_phy);
  reg_wr(RADIO_PACKETPTR, (intptr_t)pbuf_data(nr->nr_pbuf, 0));
  reg_wr(RADIO_TASKS_RXEN, 1);

  arm_timer3(con->next_anchor_point + con->transmitWindowSize);
  con->next_anchor_point += con->connInterval;
}


static void
conn_close_window(nrf54l_radio_t *nr)
{
  connection_t *con = &nr->nr_con;

  reg_wr(RADIO_TASKS_DISABLE, 1);
  reg_wr(DPPIC_CHENCLR, (1 << DPPI_CH_TXEN));

  if(nr->nr_ll_state == LL_CONNECTED_RX_1) {
    // Never heard anything from central
    con->stat.rx_silent++;
    con->window_open_offset = 1000;
    arm_timer3(con->next_anchor_point - con->window_open_offset);
    nr->nr_ll_state = LL_CONNECTED_IDLE;
    nrf54l_radio_arb_release(); // idle until next anchor: lend radio to 802.15.4
  } else {
    conn_open_window(nr);
  }
}


// RADIO END interrupt, dispatched by the arbiter when BLE owns the radio.
void
nrf54l_ble_radio_irq(void)
{
  nrf54l_radio_t *nr = &g_radio;

  if(reg_rd(RADIO_EVENTS_END)) {
    reg_wr(RADIO_EVENTS_END, 0);

    switch(nr->nr_ll_state) {
    case LL_IDLE:
      break;

    case LL_ADV_TX:
      reg_wr(RADIO_PACKETPTR, (intptr_t)pbuf_data(nr->nr_pbuf, 0));
      reg_wr(RADIO_TASKS_RXEN, 1);
      nr->nr_ll_state = LL_ADV_RX;
      break;

    case LL_ADV_RX:
      if(reg_rd(RADIO_EVENTS_CRCOK)) {
        reg_wr(RADIO_EVENTS_CRCOK, 0);
        if(adv_rx(nr))
          break;
      }
      reg_wr(RADIO_PACKETPTR, (intptr_t)pbuf_data(nr->nr_pbuf, 0));
      reg_wr(RADIO_TASKS_RXEN, 1);
      break;

    case LL_CONNECTED_IDLE:
      break;

    case LL_CONNECTED_RX_1:
    case LL_CONNECTED_RX_N:
      conn_rx_done(nr);
      break;

    case LL_CONNECTED_TX:
      conn_tx_done(nr);
      break;

    default:
      panic("radio_irq: Invalid state %d", nr->nr_ll_state);
      break;
    }
  }
}


// TIMER10 COMPARE3 interrupt (connection window timing)
void
irq_133(void)
{
  nrf54l_radio_t *nr = &g_radio;

  if(reg_rd(TIMER_BASE + TIMER_EVENTS_COMPARE(3))) {
    reg_wr(TIMER_BASE + TIMER_EVENTS_COMPARE(3), 0);

    switch(nr->nr_ll_state) {
    case LL_IDLE:
    case LL_ADV_TX:
    case LL_ADV_RX:
      break;
    case LL_CONNECTED_IDLE:
      conn_open_window(nr);
      break;
    case LL_CONNECTED_TX:
    case LL_CONNECTED_RX_1:
    case LL_CONNECTED_RX_N:
      conn_close_window(nr);
      break;
    default:
      panic("radio: Invalid state %d (timer)", nr->nr_ll_state);
    }
  }
}


static void
nrf54l_radio_print_info(struct device *dev, struct stream *st)
{
  nrf54l_radio_t *nr = (nrf54l_radio_t *)dev;

  stprintf(st, "BLE: %02x:%02x:%02x:%02x:%02x:%02x  State: %s\n",
           nr->nr_addr[5], nr->nr_addr[4], nr->nr_addr[3],
           nr->nr_addr[2], nr->nr_addr[1], nr->nr_addr[0],
           state2str[nr->nr_ll_state]);

  if(nr->nr_ll_state >= LL_CONNECTED_IDLE) {
    connection_t *con = &nr->nr_con;

    stprintf(st, "  Peer: %02x:%02x:%02x:%02x:%02x:%02x RSSI:%d\n",
             con->addr[5], con->addr[4], con->addr[3],
             con->addr[2], con->addr[1], con->addr[0], -con->rssi);
    stprintf(st, "  interval: %d  timeout: %d  PHY rx:%s tx:%s\n",
             con->connInterval, con->timeout,
             con->rx_phy & LL_PHY_2M ? "2M" : "1M",
             con->tx_phy & LL_PHY_2M ? "2M" : "1M");
    stprintf(st, "  RX:%d  BadSeq:%d  Silent:%d  CRC:%d  Drops:%d\n",
             con->stat.rx, con->stat.rx_bad_seq, con->stat.rx_silent,
             con->stat.rx_crc, con->stat.rx_qdrops);
    stprintf(st, "  TX:%d  Retransmissions:%d  Qdepth:%d\n",
             con->stat.tx, con->stat.tx_retransmissions,
             con->l2c.l2c_tx_queue_len);
    l2cap_print(&con->l2c, st);
  }

  // The other half of the shared radio.
  nrf54l_154_print(st);
}


static const device_class_t nrf54l_ble_device_class = {
  .dc_class_name = "radio",
  .dc_print_info = nrf54l_radio_print_info,
};


static void
radio_timer_init(nrf54l_radio_t *nr)
{
  // DPPI: RADIO ADDRESS -> TIMER CAPTURE[1], RADIO END -> TIMER CAPTURE[2].
  reg_wr(RADIO_PUBLISH_ADDRESS, DPPI_EN | DPPI_CH_ADDRESS);
  reg_wr(TIMER_BASE + TIMER_SUBSCRIBE_CAPTURE(1), DPPI_EN | DPPI_CH_ADDRESS);
  reg_wr(RADIO_PUBLISH_END, DPPI_EN | DPPI_CH_END);
  reg_wr(TIMER_BASE + TIMER_SUBSCRIBE_CAPTURE(2), DPPI_EN | DPPI_CH_END);

  // DPPI: TIMER COMPARE[0] -> RADIO TXEN (channel enabled only when arming TX).
  reg_wr(TIMER_BASE + TIMER_PUBLISH_COMPARE(0), DPPI_EN | DPPI_CH_TXEN);
  reg_wr(RADIO_SUBSCRIBE_TXEN, DPPI_EN | DPPI_CH_TXEN);

  reg_wr(DPPIC_CHENSET, (1 << DPPI_CH_ADDRESS) | (1 << DPPI_CH_END));

  reg_wr(TIMER_BASE + TIMER_PRESCALER, TIMER_PRESCALER_1MHZ); // 1 MHz
  reg_wr(TIMER_BASE + TIMER_BITMODE, 3);                      // 32 bit
  reg_wr(TIMER_BASE + TIMER_INTENSET, 1 << 19);              // Compare3 -> IRQ

  irq_enable(TIMER_IRQ, IRQ_LEVEL_NET);
}


static void
buffers_avail(struct netif *ni)
{
  nrf54l_radio_t *nr = (nrf54l_radio_t *)ni;

  if(!nr->nr_pbuf) {
    nr->nr_pbuf = pbuf_make(0, 0);
    reg_wr(RADIO_PACKETPTR, (intptr_t)pbuf_data(nr->nr_pbuf, 0));
    softirq_raise(nr->nr_softirq_enter_adv);
  }
}


// Transmit the advertising PDU on the next channel of the current event and
// listen briefly for a CONNECT_IND / scan request. HFXO is already running.
static void
adv_start(nrf54l_radio_t *nr)
{
  nrf54l_radio_arb_acquire(); // take the radio from 802.15.4 for this event
  radio_setup_for_adv(nr);
  memcpy(pbuf_data(nr->nr_pbuf, 0), nr->nr_adv_pkt, 2 + nr->nr_adv_pkt[1]);

  // 802.15.4 left PACKETPTR pointing at its own RX buffer; point it back at
  // the advertising PDU before transmitting.
  reg_wr(RADIO_PACKETPTR, (intptr_t)pbuf_data(nr->nr_pbuf, 0));

  reg_wr(TIMER_BASE + TIMER_TASKS_CLEAR, 1);
  reg_wr(TIMER_BASE + TIMER_TASKS_START, 1);

  reg_wr(RADIO_TASKS_TXEN, 1);
  nr->nr_ll_state = LL_ADV_TX;
  timer_arm_abs(&nr->nr_slow_timer, clock_get_irq_blocked() + 2000);
}


static void
radio_slow_timer_cb(void *opaque, uint64_t now)
{
  nrf54l_radio_t *nr = opaque;

  int q = irq_forbid(IRQ_LEVEL_NET);
  switch(nr->nr_ll_state) {

  case LL_IDLE:
    if(nr->nr_pbuf) {
      // A proper advertising event sends the PDU on all three advertising
      // channels back-to-back; scanners rotate their listening channel and
      // are much slower to find a device that hits one channel per event.
      nr->nr_adv_chans_left = 3;
      adv_start(nr);
    }
    break;

  case LL_ADV_TX:
  case LL_ADV_RX:
    reg_wr(RADIO_EVENTS_DISABLED, 0);
    reg_wr(RADIO_TASKS_DISABLE, 1);

    if(--nr->nr_adv_chans_left > 0) {
      // Next channel of the same advertising event. Bounded wait: if the
      // radio had already auto-disabled (PHYEND_DISABLE short) the event may
      // never fire, and this runs at IRQ level.
      for(int i = 0; i < 1000 && !reg_rd(RADIO_EVENTS_DISABLED); i++) {}
      adv_start(nr);
      break;
    }

    if(nr->nr_announce_interval < 500000)
      nr->nr_announce_interval += 100;

    int delta = nr->nr_announce_interval;
    delta += rand() % (nr->nr_announce_interval >> 2);
    timer_arm_abs(&nr->nr_slow_timer, now + delta);

    nr->nr_ll_state = LL_IDLE;
    reg_wr(TIMER_BASE + TIMER_TASKS_STOP, 1);
    nrf54l_radio_arb_release(); // adv event done: lend radio to 802.15.4
    break;

  default:
    break;
  }

  irq_permit(q);
}


static void
radio_enter_adv(void *opaque)
{
  nrf54l_radio_t *nr = opaque;

  int q = irq_forbid(IRQ_LEVEL_CLOCK);
  nr->nr_announce_interval = 100000;
  timer_arm_abs(&nr->nr_slow_timer,
                clock_get_irq_blocked() + nr->nr_announce_interval);
  irq_permit(q);
}


void
nrf54l_radio_ble_init(const char *name)
{
  nrf54l_radio_t *nr = &g_radio;
  nr->nr_softirq_enter_adv = softirq_alloc(radio_enter_adv, nr);

  nr->nr_empty_packet[0] = 1;
  nr->nr_empty_packet[1] = 0;

  uint32_t deviceaddr0 = reg_rd(FICR_DEVICEADDR0);
  uint32_t deviceaddr1 = reg_rd(FICR_DEVICEADDR1);

  nr->nr_addr[0] = deviceaddr0;
  nr->nr_addr[1] = deviceaddr0 >> 8;
  nr->nr_addr[2] = deviceaddr0 >> 16;
  nr->nr_addr[3] = deviceaddr0 >> 24;
  nr->nr_addr[4] = deviceaddr1;
  nr->nr_addr[5] = (deviceaddr1 >> 8) | 0xc0; // random static

  build_adv_pkt(nr, name);

  nr->nr_bn.ni_buffers_avail = buffers_avail;
  nr->nr_announce_interval = 250000;

  // The radio needs the HFXO; keep it running while the stack is up.
  nrf54l_hfxo_start();

  radio_timer_init(nr);

  // The radio interrupt is owned by the arbiter, which dispatches it to BLE
  // (nrf54l_ble_radio_irq) while BLE holds the radio.
  nrf54l_radio_arb_init();

  radio_init_ble();

  nr->nr_slow_timer.t_cb = radio_slow_timer_cb;
  nr->nr_slow_timer.t_opaque = nr;
  nr->nr_slow_timer.t_name = "radio";

  netif_init(&nr->nr_bn, "radio", &nrf54l_ble_device_class);
  netif_attach(&nr->nr_bn);
  printf("BLE radio initialized (%02x:%02x:%02x:%02x:%02x:%02x)\n",
         nr->nr_addr[5], nr->nr_addr[4], nr->nr_addr[3],
         nr->nr_addr[2], nr->nr_addr[1], nr->nr_addr[0]);
}

